[
    {
        "q": "How effective are flood panels for homes in coastal Miami?",
        "a": "<p>High-grade aluminum flood panels rated to ASTM E330 withstand hydrostatic pressures typical of Category 3 surge zones. When anchored correctly, they prevent water intrusion up to 36 inches above threshold. For coastal Miami, we recommend sealing gaskets and stainless hardware to resist salt corrosion.</p><p>Learn more about our <a href=\"/home-flood-barriers/miami\">Home Flood Barriers – Miami</a> installations.</p>"
    },
    {
        "q": "Do I need a building permit to install flood panels in Miami-Dade County?",
        "a": "<p>Permanent track or anchor installations generally require a short-form permit under the 'flood protection device' category. Removable panels that use existing openings are exempt. We coordinate permitting with Miami-Dade's Building Code Section 3109 to ensure compliance.</p>"
    },
    {
        "q": "How long does installation take?",
        "a": "<p>Most residential systems install in one working day once openings are measured. Larger multi-opening properties may require 2–3 days. Each panel system is pre-cut and pressure-tested before delivery to minimize on-site time.</p>"
    },
    {
        "q": "What maintenance is required after a storm?",
        "a": "<p>Rinse all components with fresh water, remove salt residue, and inspect gasket compression tracks. Store panels vertically in a dry area. Annual hardware checks maintain FEMA P-203 compliance.</p>"
    },
    {
        "q": "Can one person deploy the panels before a storm?",
        "a": "<p>Yes. Each 48-inch aluminum panel weighs roughly 14 lb. A single homeowner can secure a door or window bay in 3–5 minutes using quick-lock clamps supplied with the kit.</p>"
    },
    {
        "q": "Are Miami flood panels approved by insurance carriers?",
        "a": "<p>Most carriers recognize certified systems as mitigation devices and may discount wind-and-flood premiums 5–10%. Always submit the product's engineering certificate during policy renewal.</p>"
    },
    {
        "q": "How do panels compare with sandbags?",
        "a": "<p>Panels provide sealed, reusable protection without introducing contaminated sand or mold risk. They deploy faster and store compactly.</p>"
    },
    {
        "q": "What is the expected service life?",
        "a": "<p>Marine-grade aluminum panels typically last 20–25 years with annual gasket replacement every 5 years in salt-air environments.</p>"
    },
    {
        "q": "Do you offer emergency installation before storms?",
        "a": "<p>Yes. Our rapid-response team can fit pre-engineered openings within 24–48 hours before forecasted events, subject to availability.</p>"
    },
    {
        "q": "Where are flood panels manufactured?",
        "a": "<p>All systems are machined and pressure-tested in our U.S. facility in Fort Lauderdale under ISO 9001 quality control.</p>"
    }
]
