[
    {
        "q": "Why is Clearwater Beach at higher flood risk than mainland Clearwater?",
        "a": "<p>The barrier island lies only 3–5 ft above sea level and faces direct Gulf surge through Clearwater Pass. Wave run-up can exceed 7 ft during Category 3 events, making doorway protection essential.</p>"
    },
    {
        "q": "What flood panel height is recommended for beach properties?",
        "a": "<p>Minimum 36 inches; waterfront lots may need 48–60 inches based on FEMA Base Flood Elevation maps. We verify using site-specific NGVD values.</p>"
    },
    {
        "q": "Can flood panels protect sliding glass doors?",
        "a": "<p>Yes. We install vertical tracks outside the frame with removable aluminum panels that stack neatly when not in use.</p>"
    },
    {
        "q": "Will salt air damage aluminum barriers?",
        "a": "<p>Marine-grade 6063-T5 aluminum resists corrosion, but annual rinsing and optional anodized coating extend lifespan beyond 20 years.</p>"
    },
    {
        "q": "How quickly can you install before hurricane season?",
        "a": "<p>Typical lead time 10–14 days for measurement, fabrication, and install. Priority service is available May–October.</p>"
    },
    {
        "q": "Can HOA restrictions prevent barrier installation?",
        "a": "<p>Most HOAs permit removable systems if color-matched and installed within private property lines. We provide architectural submittals for approval.</p>"
    },
    {
        "q": "Are portable barriers effective for beach access points?",
        "a": "<p>Freestanding modular barriers protect driveways and walkways up to 15 ft wide. They anchor without drilling, ideal for paver or sand surfaces.</p>"
    },
    {
        "q": "What maintenance issues occur with beach sand?",
        "a": "<p>Fine sand can obstruct bottom seals. We use replaceable brush gaskets and include compressed-air cleaning kits for seasonal maintenance.</p>"
    },
    {
        "q": "Can flood protection reduce insurance costs on Clearwater Beach?",
        "a": "<p>Yes. Properties with engineered barriers may qualify for 5–15% premium reduction under the National Flood Insurance Program mitigation credit.</p>"
    },
    {
        "q": "Who handles permit drawings for beachfront installations?",
        "a": "<p>Our in-house engineer prepares signed and sealed drawings meeting Pinellas County Coastal Construction Control Line (CCCL) requirements.</p>"
    }
]
