[
    {
        "q": "Can flood panels be installed on historic homes without damaging them?",
        "a": "<p>Yes, with careful planning and reversible installation methods. We use custom-fit panels that match existing openings and avoid permanent modifications to historic materials. Installation methods are designed to be completely removable without damage to original construction.</p><p>See our <a href=\"/faq/custom-flood-panels\">custom flood panels</a> for historic home solutions.</p>"
    },
    {
        "q": "What flood protection options work best for historic homes?",
        "a": "<p>Removable flood panels offer the best solution for historic homes as they provide protection without permanent modifications. Custom-fit panels match existing door and window openings, preserving architectural character while providing effective flood protection.</p>"
    },
    {
        "q": "Do historic homes need special permits for flood barriers?",
        "a": "<p>Historic homes may require additional permits from historic preservation boards. We coordinate with local historic preservation offices to ensure compliance with preservation guidelines while providing effective flood protection.</p>"
    },
    {
        "q": "How do flood panels affect historic home aesthetics?",
        "a": "<p>Custom flood panels are designed to be visually unobtrusive when not in use. They can be painted to match existing trim and stored discreetly. During deployment, they provide protection while maintaining the home's historic character.</p>"
    },
    {
        "q": "Can flood barriers be installed on historic masonry construction?",
        "a": "<p>Yes, but special care must be taken with masonry. We use specialized anchors designed for historic masonry and avoid drilling into historic stone or brick. Custom mounting systems distribute loads evenly across historic materials.</p>"
    },
    {
        "q": "What's the cost for historic home flood protection?",
        "a": "<p>Historic home flood protection typically costs 20-40% more than standard installations due to custom fabrication and specialized installation methods. Costs range from $10,000-$35,000 depending on the number of openings and complexity of the historic construction.</p>"
    },
    {
        "q": "How do I choose flood protection that preserves historic value?",
        "a": "<p>Work with contractors experienced in historic preservation. Choose reversible installation methods, custom-fit panels, and materials that complement historic architecture. Document all work for historic preservation records and future reference.</p>"
    }
]
