[
    {
        "q": "How do flood barriers resist corrosion in coastal environments?",
        "a": "<p>Coastal flood barriers use 316 stainless steel hardware, marine-grade aluminum alloys, and specialized coatings to resist salt corrosion. Our barriers undergo salt spray testing per ASTM B117 for 1000+ hours. EPDM gaskets and nylon washers prevent galvanic corrosion between dissimilar metals.</p><p>See our <a href=\"/faq/hardware-corrosion-control\">hardware corrosion control</a> guide for maintenance tips.</p>"
    },
    {
        "q": "What aluminum alloys work best for coastal flood barriers?",
        "a": "<p>6061-T6 aluminum offers excellent corrosion resistance and strength for coastal applications. For extreme salt exposure, we use 5052-H32 marine-grade aluminum with anodized or powder-coated finishes. These alloys maintain structural integrity for 20+ years in coastal environments.</p>"
    },
    {
        "q": "How often should coastal flood barriers be inspected for corrosion?",
        "a": "<p>Monthly visual inspections during storm season, quarterly detailed inspections year-round. Check for white corrosion deposits, pitting, or gasket deterioration. After each storm deployment, rinse with fresh water and inspect hardware for signs of galvanic corrosion.</p>"
    },
    {
        "q": "Can corroded flood barrier hardware be repaired?",
        "a": "<p>Light surface corrosion can be cleaned with aluminum-safe cleaners. Deep pitting over 10% of fastener diameter requires replacement. We stock 316 stainless replacements and provide repair kits for common corrosion issues.</p>"
    },
    {
        "q": "What coatings protect flood barriers from salt damage?",
        "a": "<p>Powder-coated polyester finishes provide the best salt resistance, followed by anodized aluminum. Avoid painted finishes in coastal zones as they chip and expose metal. Our marine-grade coatings are tested for 15+ years of coastal exposure.</p>"
    },
    {
        "q": "Do coastal flood barriers need different gaskets?",
        "a": "<p>Yes, coastal environments require EPDM or neoprene gaskets rated for salt exposure. Avoid natural rubber gaskets which degrade in salt air. Our gaskets are specifically formulated for marine environments and resist ozone and UV damage.</p>"
    }
]
