[
    {
        "q": "When should I choose custom flood panels instead of standard sizes?",
        "a": "<p>Choose custom panels when openings exceed 72 inches, have irregular shapes, or require integration with glass façades. Custom fabrication ensures proper compression and aesthetic alignment.</p>"
    },
    {
        "q": "How are custom panels fabricated?",
        "a": "<p>We 3-D scan each opening, produce CAD drawings, and CNC-cut panels from 6061-T6 aluminum. Gaskets are vulcanized for continuous seal integrity.</p>"
    },
    {
        "q": "What's the cost difference between custom and standard panels?",
        "a": "<p>Custom units average 25–35% higher due to fabrication time, but long-term sealing efficiency lowers maintenance costs.</p>"
    },
    {
        "q": "Can custom panels be motorized?",
        "a": "<p>Yes. For commercial properties, we integrate motorized lift rails with battery backup and smart sensors for remote deployment.</p>"
    },
    {
        "q": "Are custom systems code-approved?",
        "a": "<p>All designs carry independent engineer sign-off and meet ASCE 24 and FEMA TB-3 standards for dry floodproofing.</p>"
    },
    {
        "q": "Do custom panels add resale value?",
        "a": "<p>Yes. Properties with engineered floodproofing appraise 5–8% higher in coastal markets.</p>"
    },
    {
        "q": "Can you retrofit historic homes?",
        "a": "<p>We use removable clamp-frame designs that avoid permanent alterations, keeping compliance with historic preservation codes.</p>"
    },
    {
        "q": "How long is the fabrication lead time?",
        "a": "<p>Typically 2–3 weeks after final measurement approval.</p>"
    },
    {
        "q": "What warranty applies to custom panels?",
        "a": "<p>Ten-year structural, five-year gasket. Extended warranties available with annual inspection.</p>"
    },
    {
        "q": "Can custom panels be color-matched?",
        "a": "<p>Yes. We offer powder-coating in RAL 9003 (white), 7035 (gray), and 7021 (charcoal) as standard finishes.</p>"
    }
]
