[
    {
        "q": "What makes a flood barrier FEMA-approved?",
        "a": "<p>FEMA-approved flood barriers meet Technical Bulletin 3 (TB-3) requirements for flood-resistant materials and construction. They must withstand hydrostatic pressure testing, resist flotation, and maintain structural integrity during flood conditions. Our barriers exceed TB-3 standards with third-party certification.</p><p>See our <a href=\"/faq/fema-installation-guidelines\">FEMA installation guidelines</a> for compliance details.</p>"
    },
    {
        "q": "Do FEMA-approved barriers qualify for insurance discounts?",
        "a": "<p>Yes, FEMA-approved flood barriers may qualify for NFIP premium reductions of 5-45% depending on barrier type and installation method. The Community Rating System (CRS) provides additional discounts for communities with certified flood protection measures.</p>"
    },
    {
        "q": "How do I verify a flood barrier is FEMA-approved?",
        "a": "<p>Check for FEMA Technical Bulletin 3 compliance documentation, third-party testing certificates, and manufacturer certifications. Approved barriers will have specific model numbers listed in FEMA's database. We provide complete documentation for all certified products.</p>"
    },
    {
        "q": "What testing standards do FEMA-approved barriers meet?",
        "a": "<p>FEMA-approved barriers undergo hydrostatic pressure testing per ASTM E330, impact resistance testing per ASTM E1886, and cyclic loading tests. They must resist flotation forces and maintain watertight seals under sustained pressure for the rated flood height.</p>"
    },
    {
        "q": "Can existing flood barriers be retrofitted to meet FEMA standards?",
        "a": "<p>Some existing barriers can be upgraded with FEMA-compliant gaskets, hardware, and anchoring systems. However, structural modifications may be required. We assess existing installations and provide upgrade paths to achieve FEMA compliance.</p>"
    },
    {
        "q": "Do FEMA-approved barriers require special installation?",
        "a": "<p>Yes, FEMA-approved barriers must be installed per manufacturer specifications and local building codes. Installation requires certified contractors and may need permits. We provide certified installation services and coordinate with local building departments.</p>"
    }
]
