[
    {
        "q": "What preparation is required before flood barrier installation?",
        "a": "<p>Openings must be clean, level, and structurally sound. We laser-measure thresholds, check slab slope tolerance (≤3 mm), and verify substrate compressive strength above 2,500 psi. A smooth surface ensures gasket compression to ASTM E330 standards.</p><p>See also <a href=\"/faq/door-threshold-prep\">door-threshold preparation</a> and <a href=\"/home-flood-barriers/miami\">Miami flood-barrier services</a>.</p>"
    },
    {
        "q": "How long does a full-house installation take?",
        "a": "<p>Typical 3–5 opening homes complete within one working day. Complex perimeters or multiple garage spans may require 2–3 days. Panels are prefabricated from CAD scans to reduce onsite fabrication time.</p>"
    },
    {
        "q": "Are flood barrier tracks permanently fixed?",
        "a": "<p>Yes. Aluminum side channels anchor with 316 SS bolts and marine-grade epoxy. Tracks remain low-profile year-round and are paintable for aesthetics. Removable clamps are available for heritage façades.</p>"
    },
    {
        "q": "Do installations require building permits?",
        "a": "<p>Most jurisdictions classify flood barriers as <em>dry-floodproofing devices</em>. Permanent anchoring needs a minor permit; removable panels generally do not. We file through ePermitting for each city (<a href=\"/home-flood-barriers/clearwater\">Clearwater flood barriers</a>, <a href=\"/home-flood-barriers/naples\">Naples</a>, etc.).</p>"
    },
    {
        "q": "What is included in the installation package?",
        "a": "<p>Engineering drawings, material certification, site prep, anchor setting, panel fitting, and homeowner demonstration. Optional pressure-test certification available upon request.</p>"
    },
    {
        "q": "Can barriers be installed on uneven driveways?",
        "a": "<p>Yes. We shim or grind within 3 mm tolerance and use compressive EPDM gaskets to close gaps. For slopes exceeding 1 inch per 4 ft, we fabricate tapered panels.</p>"
    },
    {
        "q": "How do you ensure watertight performance after installation?",
        "a": "<p>Every completed system undergoes a static water test for 15 minutes to verify seal continuity. Results are documented for insurance compliance.</p>"
    },
    {
        "q": "What post-installation support is provided?",
        "a": "<p>Clients receive a maintenance manual, torque schedule, and direct technician line. Annual inspection renewals extend the 10-year structural warranty.</p>"
    }
]
