[
    {
        "q": "How do I identify the source of flood panel leaks?",
        "a": "<p>Leaks typically occur at gasket compression points, corner joints, or hardware penetration points. Use a water test with 1-inch water column for 10 minutes to identify leak locations. Check for gasket compression set, damaged seals, or misaligned panels.</p><p>See our <a href=\"/faq/flood-panel-repair\">flood panel repair</a> guide for detailed troubleshooting.</p>"
    },
    {
        "q": "Can leaking flood panels be repaired without replacement?",
        "a": "<p>Yes, most leaks can be repaired by replacing gaskets, resealing joints, or adjusting compression bolts. However, panels with structural damage or severe corrosion should be replaced. We assess each leak and provide repair vs. replacement recommendations.</p>"
    },
    {
        "q": "What causes flood panel gaskets to fail?",
        "a": "<p>Gasket failure is typically caused by compression set from over-tightening, UV degradation, or chemical exposure. EPDM gaskets last 5-7 years in coastal environments. Regular inspection and proper compression torque prevent premature failure.</p>"
    },
    {
        "q": "How do I repair leaking corner joints on flood panels?",
        "a": "<p>Clean the joint area, remove old sealant, and apply marine-grade polyurethane sealant. Allow 48-hour cure time before testing. Use backer rod for joints over 1/4 inch wide. Test with hydrostatic pressure after repair.</p>"
    },
    {
        "q": "Can I repair flood panel leaks myself?",
        "a": "<p>Simple gasket replacements and sealant repairs can be done by homeowners with proper tools and materials. However, structural repairs or major leaks should be handled by professionals to ensure proper sealing and maintain warranty coverage.</p>"
    },
    {
        "q": "How much does flood panel leak repair cost?",
        "a": "<p>Simple gasket replacements cost $50-150 per panel. Major leak repairs range from $200-500 per panel. Complete panel replacement costs $300-800 per panel depending on size and materials. We provide free estimates for all repair work.</p>"
    }
]
