[
    {
        "q": "What are residential flood panels and how do they work?",
        "a": "<p>Residential flood panels are modular, watertight panels designed for home entry points like doors, windows, and garage openings. They use compressive EPDM gaskets to create watertight seals that prevent floodwater intrusion during storms and hurricanes.</p><p>Our panels are FEMA-approved and reusable for decades of protection. See our <a href=\"/residential-flood-panels/miami\">Miami residential flood panels</a>.</p>"
    },
    {
        "q": "How much do residential flood panels cost?",
        "a": "<p>Residential flood panels typically cost $899-$1,499 per opening depending on size and configuration. Entry door panels start around $899, while larger garage opening systems range from $1,299-$1,999. All panels are reusable and may qualify for up to <a href=\"/faq/grant-programs\">$10,000 in FEMA flood mitigation grants</a>.</p>"
    },
    {
        "q": "Are residential flood panels FEMA-certified?",
        "a": "<p>Yes, our residential flood panels exceed FEMA Technical Bulletin 3 (TB-3) standards with third-party certification. They withstand hydrostatic pressure testing per ASTM E330 and provide watertight seals rated for flood heights up to 8 feet.</p><p>FEMA-certified installations may qualify for <a href=\"/faq/insurance-premium-reduction\">insurance premium reductions</a> of 5-45%.</p>"
    },
    {
        "q": "Can residential flood panels fit uneven door thresholds?",
        "a": "<p>Yes, our panels use adjustable side posts and compressive gaskets that conform to irregular thresholds. For larger offsets, we prep the sill with removable shims to maintain seal integrity. Panels install in 3-6 minutes once tracks are set.</p><p>See our <a href=\"/faq/door-threshold-prep\">door threshold preparation guide</a>.</p>"
    },
    {
        "q": "How do you install residential flood panels?",
        "a": "<p>Installation involves anchor-based side tracks bolted to door frames, then panels are inserted and sealed with gaskets. Full 3-5 opening installation typically completes in one working day. We laser-measure all openings for precise fit and provide engineering drawings for documentation.</p><p>See our <a href=\"/faq/flood-barrier-installation\">installation process FAQ</a>.</p>"
    },
    {
        "q": "What maintenance do residential flood panels require?",
        "a": "<p>Minimal maintenance: rinse panels with fresh water after use, inspect EPDM gaskets for debris or damage, allow components to dry completely before storage. Annual gasket inspection extends the 10-year warranty. Gaskets typically last 5-7 years with proper care.</p><p>We provide <a href=\"/faq/gasket-replacement\">gasket replacement service</a> and maintenance protocols.</p>"
    },
    {
        "q": "Can residential flood panels be used for multiple door sizes?",
        "a": "<p>Our modular residential flood panels are customizable to fit standard and custom door sizes. We fabricate panels to exact measurements using CAD scans. Multiple panels can be joined for larger openings like garage doors and wide entryways.</p><p>Call us at <a href=\"tel:+12398108761\">(239) 810-8761</a> for custom sizing assessment.</p>"
    },
    {
        "q": "Do residential flood panels work for both interior and exterior openings?",
        "a": "<p>Yes, residential flood panels protect both interior and exterior openings. Many homeowners use them for front doors, garage openings, French doors, sliding doors, and basement entry points. We assess your home's vulnerabilities and recommend panel placement for maximum protection.</p>"
    },
    {
        "q": "How do residential flood panels compare to permanent flood walls?",
        "a": "<p>Residential flood panels offer flexibility: they're removable and won't permanently alter your home's appearance. Permanent flood walls require major construction and can't be removed. Our panels provide the same protection level (FEMA-approved, watertight seals) while maintaining your home's aesthetics.</p><p>See <a href=\"/faq/permanent-vs-removable-barriers\">permanent vs. removable barriers comparison</a>.</p>"
    },
    {
        "q": "What if I need help installing my residential flood panels?",
        "a": "<p>We provide complete professional installation services including measurement, fabrication, anchor installation, and homeowner training. Most installations complete in one day. We also offer installation guides for DIY-friendly setups if you prefer to install yourself.</p><p>Contact us for a free assessment and installation quote throughout Florida.</p>"
    }
]

